#include <stdio.h>
#include <string.h>
//涉及到整型提升
//int main() {
//	char a = -1;//源码:10000001,反码:11111110,补码11111111
//	signed char b = -1;//源码:10000001,反码:11111110,补码11111111
//	unsigned char c = -1;//源码:10000001,反码:11111110,补码11111111
//	//但是他们在打印的时候是整型,所以要整型提升
//	//a因为是他的补码是11111111,整型提升后高位为1所以11111111111111111111111111111111
//	//b因为是有符号位因此和a一样,整型提升后高位为1所以11111111111111111111111111111111
//	//c是无符号位,所以它在整型提升过程中00000000000000000000000011111111,//又因为这是正数,原样输出
//	printf("a=%d,b=%d,c=%d", a, b, c);//-1,-1,255
//	return 0;
//}

//int main() {
//	char a = 128;//有符号char的最小值和最大值为-128和127
//	//该char是有符号位但是最大值只能是127,
//	//所以10000000000000000000000010000000源码,1111111111111111111111110111111反码,1111111111111111111111111000000补码
//	printf("%u", a);//%u打印10进制无符号位
//	return 0;
//}

//int main() {
//	unsigned int i;//一直死循环,为什么,因为无符号数塔永远都是正数,永远大于0;
//	for (i = 9; i >=0; i--)
//	{
//		printf("%u\n", i);
//	}
//}

//int main() {
//	char a[1000];
//	int i = 0;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%u\n", strlen(a));
//	return 0;
//}

/*浮点类型的存储*/  
// 科学计数法   1.02  => 102*10-2    4字节 32位  1符号位   23有效位数  8指数位
//9.0 = 1001.0
//(-1)^S*   M *2^E
//(-1)^0*1.001*2^3;因为任何数的0次方都等于1
//0.5 = (-1)^0*0.1*2^-1
//5 = (-1)^0*1.01*2^2 
int main() {
	int n = 9;
	float* ploat = (float*)&n;
	printf("n值为:%d\n", n);
	printf("*pfloat值为:%f\n", *ploat);
	*ploat = 9.0;
	printf("n值为:%d\n", n);
	printf("*pfloat值为:%f\n", *ploat);
	//*2   <<1  *4 << 2
	int a = 5;
	int b = a << 1;
	printf("%d \n", b);
	return 0;
}

